// int [] arr = new int [5];
// arr[0] = 5;
// arr[1] = 7;
// arr[2] = 5;
// arr[3] = 4;
// arr[4] = 3;
// System.Console.WriteLine(arr[0]);
// System.Console.WriteLine(arr[1]);
// System.Console.WriteLine(arr[2]);
// System.Console.WriteLine(arr[3]);
// System.Console.WriteLine(arr[4]);


// int[] arr2 = new int[5]{1,2,3,4,5};


// int[] arr3 = {1,2,3,4,5};

// Задача 1.Содать массив и заполнить его целыми
// числами от 1 до N (N – произвольное
// натуральное число). Вывести элементы
// массива на экран.

// Пример 1
// N = 4
// 1 2 3 4
// Пример 2
// Т = 6
// 1 2 3 4 5 6

// int n = 10;
// int[] arr = new int [n];
// int i  = 0;

// while(i < n)
// {
//     arr[i] = i + 1;
//      System.Console.Write($"{arr[i]} ");
//      i++;


// }


// Задача №2
// Создать целочисленный массив на 10
// элементов и заполнить его произвольными
// числами. Вывести на экран чётные элементы
// массива.

// Пример 1
// Массив: [1 5 4 6 9 3 2 5 4 1]
// Чётные: 4 6 2 4
// Пример 2
// Массив: [9 5 1 7 15 36 3 1 1 7]
// Чётные: 36


// //int n = 10;
// int[] array = {1,5,4,6,9,3,2,5,4,1};
// int i = 0;
// while( i < array.Length)
// {
//     if(array[i] % 2 == 0)
//     {
//         System.Console.Write($"{array[i]} ");
     
//     }
//      i++;
// }



// Задача №3
// Дано N гирь с разным весом в случайном
// порядке. Определить вес самой тяжелой
// гири.

// int n = 5;
// int[] array = {2,4,7,3,9};
// int i = 0;
// int max = array[0];

// while(i < n)
// {
//     if(array[i] > max)
// {
// max = array[i];
// }
// i++;
// }
// System.Console.Write(max);



