// int [] arr = new int [5];
// arr[0] = 5;
// arr[1] = 7;
// arr[2] = 5;
// arr[3] = 4;
// arr[4] = 3;
// System.Console.WriteLine(arr[0]);
// System.Console.WriteLine(arr[1]);
// System.Console.WriteLine(arr[2]);
// System.Console.WriteLine(arr[3]);
// System.Console.WriteLine(arr[4]);


// int[] arr2 = new int[5]{1,2,3,4,5};


// int[] arr3 = {1,2,3,4,5};

// Задача 1.Содать массив и заполнить его целыми
// числами от 1 до N (N – произвольное
// натуральное число). Вывести элементы
// массива на экран.

// Пример 1
// N = 4
// 1 2 3 4
// Пример 2
// Т = 6
// 1 2 3 4 5 6

// int n = 10;
// int[] arr = new int [n];
// int i  = 0;

// while(i < n)
// {
//     arr[i] = i + 1;
//      System.Console.Write($"{arr[i]} ");
//      i++;


// }